CSI API ETABS v1
cCaseStaticNonlinearStaged.SetTargetForceParameters Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTargetForceParameters(
	string Name,
	double TolConvF,
	int MaxIter,
	double AccelFact,
	bool NoStop
)
Function SetTargetForceParameters (
	Name As String,
	TolConvF As Double,
	MaxIter As Integer,
	AccelFact As Double,
	NoStop As Boolean
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim TolConvF As Double
Dim MaxIter As Integer
Dim AccelFact As Double
Dim NoStop As Boolean
Dim returnValue As Integer
returnValue = instance.SetTargetForceParameters(Name,
	TolConvF, MaxIter, AccelFact, NoStop)
int SetTargetForceParameters(
	String^ Name,
	double TolConvF,
	int MaxIter,
	double AccelFact,
	bool NoStop
)
abstract SetTargetForceParameters :
        Name : string *
        TolConvF : float *
        MaxIter : int *
        AccelFact : float *
        NoStop : bool -> int
Parameters
Name
Type: System.String
TolConvF
Type: System.Double
MaxIter
Type: System.Int32
AccelFact
Type: System.Double
NoStop
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace